tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "homebrew/services"
tap "artginzburg/tap"
tap "kyoh86/tap"
tap "sdkman/tap"

brew "ack"
brew "bat"
brew "buf"
brew "bottom"
brew "difftastic"
brew "dust"
brew "fd"
brew "htop"
brew "httpie"
brew "keychain"
brew "jq"
brew "openssl"
brew "procs"
brew "pstree"
brew "readline"
brew "sd"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "watch"
brew "yq"
brew "bash"
brew "bash-completion"
brew "glib"
brew "clang-format"
brew "ruby"
brew "coreutils"
brew "curl"
brew "leptonica"
brew "eza"
brew "fastfetch"
brew "libssh"
brew "fish"
brew "gh"
brew "git"
brew "git-now"
brew "llvm"
brew "make"
brew "mas"
brew "msgpack"
brew "zlib"
brew "mysql-client"
brew "neovim"
brew "protobuf"
brew "pv"
brew "rlwrap"
brew "rsync"
brew "swift-format"
brew "swift-sh"
brew "terminal-notifier"
brew "typos-cli"
brew "typos-lsp"
brew "wget"
brew "xh"
brew "artginzburg/tap/sudo-touchid"
brew "kyoh86/tap/git-branches"
brew "kyoh86/tap/git-vertag"
brew "sdkman/tap/sdkman-cli"

cask "audacity"
cask "deepl"
cask "discord"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "imageoptim"
cask "jetbrains-toolbox"
cask "jupyter-notebook-viewer"
cask "karabiner-elements"
cask "keyclu"
cask "piphero"
cask "raycast"
cask "shottr"
cask "visual-studio-code"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Be Focused", id: 973134470
mas "Command X", id: 6448461551
mas "DevCleaner", id: 1388020431
mas "FocusRecorder", id: 6446467176
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Pages", id: 409201541
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Uninstaller sensei", id: 1373706803
mas "Xcode", id: 497799835

whalebrew "directory"

vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "anseki.vscode-color"
vscode "antfu.browse-lite"
vscode "antfu.iconify"
vscode "antfu.smart-clicks"
vscode "antonholmberg.remove-bg"
vscode "arjun.swagger-viewer"
vscode "asvetliakov.vscode-neovim"
vscode "be5invis.toml"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bradgashler.htmltagwrap"
vscode "bradlc.vscode-tailwindcss"
vscode "cab404.vscode-direnv"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "cnshenj.vscode-task-manager"
vscode "codezombiech.gitignore"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "deerawan.vscode-faker"
vscode "denoland.vscode-deno"
vscode "dominicvonk.auto-toggle-sidebar"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-open-in-github"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "formulahendry.github-actions"
vscode "fregante.ghost-text"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-codeql"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hbenl.vscode-test-explorer"
vscode "helgardrichard.helium-icon-theme"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "humao.rest-client"
vscode "ibm.output-colorizer"
vscode "janisdd.vscode-edit-csv"
vscode "jonathanharty.gruvbox-material-icon-theme"
vscode "jrebocho.vscode-random"
vscode "keyring.lua"
vscode "marp-team.marp-vscode"
vscode "mhutchie.git-graph"
vscode "mkxml.vscode-filesize"
vscode "mosapride.zenkaku"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "mylesmurphy.prettify-ts"
vscode "nickdemayo.vscode-json-editor"
vscode "oderwat.indent-rainbow"
vscode "oven.bun-vscode"
vscode "peakchen90.open-html-in-browser"
vscode "pomber.git-file-history"
vscode "praveencrony.total-lines"
vscode "qufiwefefwoyn.kanagawa"
vscode "rcore.rcore-unused-css-classes"
vscode "sgryjp.japanese-word-handler"
vscode "shardulm94.trailing-spaces"
vscode "simonsiefke.svg-preview"
vscode "skyapps.fish-vscode"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tshino.kb-macro"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "wmaurer.change-case"
vscode "wraith13.bracket-lens"
vscode "wraith13.file-path-bar"
vscode "yoavbls.pretty-ts-errors"
vscode "zxh404.vscode-proto3"
vscode "dsznajder.es7-react-js-snippets"
