tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "artginzburg/tap"
tap "d-kuro/tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "k1low/tap"
tap "kyoh86/tap"
tap "mihaelamj/tap"
tap "mike-engel/jwt-cli"
tap "peripheryapp/periphery"
tap "sdkman/tap"
tap "smudge/smudge"
brew "ack"
brew "brotli"
brew "aicommits"
brew "alp"
brew "aria2"
brew "autoconf"
brew "pycparser"
brew "cffi"
brew "docutils"
brew "python@3.11"
brew "awscli"
brew "base64"
brew "bash"
brew "bash-completion"
brew "bat"
brew "berkeley-db", link: true
brew "bitrise"
brew "bottom"
brew "buf"
brew "pcre2"
brew "glib"
brew "carthage"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cocoapods"
brew "gmp"
brew "coreutils"
brew "cue"
brew "rtmpdump"
brew "curl"
brew "diff-so-fancy"
brew "difftastic"
brew "dust"
brew "exa"
brew "eza"
brew "fastfetch"
brew "fd"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fq"
brew "fzf"
brew "isl"
brew "mpfr"
brew "gcc"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-now"
brew "git-secrets"
brew "gnu-tar"
brew "go"
brew "gobject-introspection"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "gron"
brew "guile"
brew "hexyl"
brew "htop"
brew "httpie"
brew "hub"
brew "hyperfine"
brew "jnv"
brew "jq"
brew "keychain"
brew "lapack"
brew "lazydocker"
brew "lazygit"
brew "libxml2"
brew "lsd"
brew "lua"
brew "make"
brew "mas"
brew "mermaid-cli"
brew "mockolo"
brew "zlib"
brew "mysql-client"
brew "ncdu"
brew "neovim"
brew "openssl@1.1"
brew "nghttp2"
brew "node-build"
brew "nodenv"
brew "numpy"
brew "openjdk"
brew "openjdk@11"
brew "openjdk@17"
brew "opus-tools"
brew "pastel"
brew "pcre"
brew "peco"
brew "perl"
brew "procs"
brew "protobuf"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "swift-protobuf"
brew "protoc-gen-grpc-swift"
brew "pstree"
brew "pure"
brew "pv"
brew "pybind11"
brew "python@3.10"
brew "python@3.9"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rlwrap"
brew "rsync"
brew "ruby@2.7"
brew "rust"
brew "scipy"
brew "sd"
brew "spark"
brew "starship"
brew "swift-format"
brew "swift-sh"
brew "swiftgen"
brew "swiftlint"
brew "terminal-notifier"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tokei"
brew "tree"
brew "typos-cli"
brew "typos-lsp"
brew "unar"
brew "vim"
brew "watch"
brew "wget"
brew "xcodegen"
brew "xcodes"
brew "xh"
brew "yq"
brew "zsh"
brew "artginzburg/tap/sudo-touchid"
brew "d-kuro/tap/gwq"
brew "kyoh86/tap/git-branches"
brew "kyoh86/tap/git-vertag"
brew "mihaelamj/tap/cupertino"
brew "mike-engel/jwt-cli/jwt-cli"
brew "sdkman/tap/sdkman-cli"
brew "smudge/smudge/nightlight"
cask "android-platform-tools"
cask "audacity"
cask "chatgpt"
cask "claude"
cask "coteditor"
cask "cursor"
cask "dash"
cask "deepl"
cask "discord"
cask "docker-desktop"
cask "font-udev-gothic"
cask "font-udev-gothic-nf"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "imageoptim"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "jupyter-notebook-viewer"
cask "keyclu"
cask "periphery"
cask "piphero"
cask "proxyman"
cask "raycast"
cask "secretive"
cask "shottr"
cask "slack"
cask "visual-studio-code"
cask "xcodes-app"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "AS Timer", id: 512464723
mas "Blackmagic Disk Speed Test", id: 425264550
mas "ColorSnapper", id: 418176775
mas "Core Data Lab", id: 1460684638
mas "CotEditor", id: 1024640650
mas "Craft", id: 1487937127
mas "Developer", id: 640199958
mas "Draw Things", id: 6444050820
mas "GarageBand", id: 682658836
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Kindle Classic", id: 405399194
mas "LINE", id: 539883307
mas "MeetingBar", id: 1532419400
mas "MotionScape", id: 1616840951
mas "Numbers", id: 409203825
mas "ocenaudio", id: 1489522786
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Pocket", id: 568494494
mas "Save to Raindrop.io", id: 1549370672
mas "Scapple", id: 568020055
mas "Slack", id: 803453959
mas "StuffIt Expander", id: 919269455
mas "Telegram Lite", id: 946399090
mas "TestFlight", id: 899247664
mas "Tomato One", id: 907364780
mas "Uninstaller sensei", id: 1373706803
mas "waifu2x", id: 1286485858
mas "Whisper Transcription", id: 1668083311
vscode "arjun.swagger-viewer"
vscode "bierner.markdown-mermaid"
vscode "docker.docker"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ionutvmi.path-autocomplete"
vscode "marp-team.marp-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
