tap "apple/apple", "http://github.com/apple/homebrew-apple"
tap "artginzburg/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kyoh86/tap"
tap "sdkman/tap"
brew "ack"
brew "aicommits"
brew "bash"
brew "bash-completion"
brew "bat"
brew "bottom"
brew "buf"
brew "clang-format"
brew "coreutils"
brew "curl"
brew "difftastic"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fish"
brew "gh"
brew "git"
brew "git-now"
brew "readline"
brew "glib"
brew "glow"
brew "htop"
brew "httpie"
brew "hyperfine"
brew "jnv"
brew "jq"
brew "keychain"
brew "leptonica"
brew "libssh"
brew "libxml2"
brew "llvm"
brew "make"
brew "mas"
brew "zlib"
brew "mysql-client"
brew "neovim"
brew "peco"
brew "procs"
brew "protobuf"
brew "pstree"
brew "pure"
brew "pv"
brew "rlwrap"
brew "rsync"
brew "sd"
brew "spark"
brew "swift-format"
brew "swift-sh"
brew "terminal-notifier"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "typos-cli"
brew "typos-lsp"
brew "watch"
brew "wget"
brew "xh"
brew "yq"
brew "artginzburg/tap/sudo-touchid"
brew "kyoh86/tap/git-branches"
brew "kyoh86/tap/git-vertag"
brew "sdkman/tap/sdkman-cli"
cask "audacity"
cask "chatgpt"
cask "claude"
cask "coteditor"
cask "cursor"
cask "dash"
cask "deepl"
cask "discord"
cask "docker"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "imageoptim"
cask "istat-menus"
cask "jetbrains-toolbox"
cask "jupyter-notebook-viewer"
cask "karabiner-elements"
cask "keyclu"
cask "piphero"
cask "proxyman"
cask "raycast"
cask "secretive"
cask "shottr"
cask "slack"
cask "visual-studio-code"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Be Focused", id: 973134470
mas "Command X", id: 6448461551
mas "Core Data Lab", id: 1460684638
mas "DevCleaner", id: 1388020431
mas "FocusRecorder", id: 6446467176
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "LINE", id: 539883307
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Sequel Ace", id: 1518036000
mas "Slack", id: 803453959
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Uninstaller sensei", id: 1373706803
mas "Xcode", id: 497799835
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "rooveterinaryinc.roo-cline"
